{
  "questions": [
    {
      "id": 1,
      "title": "Long-term goals",
      "questionText": "Describe a long-term personal goal that you have worked toward for months or even years. What challenges did you encounter along the way, and how did you overcome them?",
      "instructions": "Your answer should include: 1. The goal you pursued. 2. The duration it took to achieve it. 3. The obstacles you faced and how you managed them.",
      "timeLimit": 120,
      "rubric": {
        "criteria": [
          {
            "name": "Goal Complexity and Ambition",
            "points": [
              {
                "score": 5,
                "description": "Goal is highly complex, requiring multiple steps and significant personal growth to achieve. Demonstrates exceptional ambition and vision."
              },
              {
                "score": 4,
                "description": "Goal is challenging and requires sustained effort across multiple areas of development. Shows clear ambition."
              },
              {
                "score": 3,
                "description": "Goal requires moderate effort and some planning. Demonstrates reasonable ambition but could be more challenging."
              },
              {
                "score": 2,
                "description": "Goal is relatively simple or short-term in nature. Limited evidence of strategic thinking or ambition."
              },
              {
                "score": 1,
                "description": "Goal lacks complexity or meaningful challenge. Minimal evidence of long-term planning or ambition."
              }
            ]
          },
          {
            "name": "Progress and Achievement",
            "points": [
              {
                "score": 5,
                "description": "Demonstrates substantial progress or complete achievement of the goal with clear, measurable outcomes over an extended period (1+ years)."
              },
              {
                "score": 4,
                "description": "Shows significant progress toward the goal with tangible results over several months to a year."
              },
              {
                "score": 3,
                "description": "Indicates moderate progress with some measurable outcomes, though may be still in progress."
              },
              {
                "score": 2,
                "description": "Shows limited progress or is in early stages with few concrete results."
              },
              {
                "score": 1,
                "description": "Minimal progress demonstrated or lacks clear evidence of advancement toward the goal."
              }
            ]
          },
          {
            "name": "Problem-Solving and Resilience",
            "points": [
              {
                "score": 5,
                "description": "Exceptionally detailed description of multiple significant challenges and innovative solutions. Shows remarkable resilience and adaptability."
              },
              {
                "score": 4,
                "description": "Clear explanation of several challenges and effective strategies used to overcome them. Demonstrates strong problem-solving skills."
              },
              {
                "score": 3,
                "description": "Describes some challenges and basic problem-solving approaches. Shows moderate resilience."
              },
              {
                "score": 2,
                "description": "Limited discussion of challenges or superficial problem-solving strategies. Shows basic resilience."
              },
              {
                "score": 1,
                "description": "Minimal or no discussion of challenges faced or how they were addressed. Little evidence of problem-solving or resilience."
              }
            ]
          }
        ]
      }
    },
    {
      "id": 2,
      "title": "Habits",
      "questionText": "What is a habit or routine that you have been consistently following for a long time, even though it is challenging?",
      "instructions": "Your answer should include: 1. What the habit involves. 2. How often you practice it. 3. How long you have maintained it.",
      "timeLimit": 120,
      "rubric": {
        "criteria": [
          {
            "name": "Consistency and Frequency",
            "points": [
              {
                "score": 5,
                "description": "The habit is performed daily or nearly daily (5-7 times per week), demonstrating a high level of commitment."
              },
              {
                "score": 4,
                "description": "The habit is performed 3-4 times per week with consistency, showing solid discipline."
              },
              {
                "score": 3,
                "description": "The habit is performed 1-2 times per week consistently, but may occasionally miss some sessions."
              },
              {
                "score": 2,
                "description": "The habit is performed occasionally (1-2 times per month), indicating some gaps in consistency."
              },
              {
                "score": 1,
                "description": "The habit is performed infrequently or sporadically, with many gaps in maintaining the habit."
              }
            ]
          },
          {
            "name": "Duration of the Habit",
            "points": [
              {
                "score": 5,
                "description": "The habit has been maintained for 3 years or more, showing a long-term commitment."
              },
              {
                "score": 4,
                "description": "The habit has been maintained for 1-2 years, indicating a strong but slightly shorter commitment."
              },
              {
                "score": 3,
                "description": "The habit has been maintained for 6-12 months, showing some stability but lacking longer-term persistence."
              },
              {
                "score": 2,
                "description": "The habit has been maintained for 3-6 months, suggesting recent adoption with potential for growth."
              },
              {
                "score": 1,
                "description": "The habit has been maintained for less than 3 months, indicating it may not yet be a deeply ingrained routine."
              }
            ]
          },
          {
            "name": "Persistence Through Challenges",
            "points": [
              {
                "score": 5,
                "description": "The habit involves significant effort, with the person continuing despite multiple challenges or setbacks (e.g., time constraints, physical or mental difficulty, competing priorities)."
              },
              {
                "score": 4,
                "description": "The habit involves moderate challenges, and the person consistently finds ways to continue even when it's inconvenient or difficult."
              },
              {
                "score": 3,
                "description": "The habit involves occasional difficulties, but the person has managed to maintain it without major disruptions."
              },
              {
                "score": 2,
                "description": "The habit has faced minimal challenges, and the person's ability to persist hasn't been significantly tested."
              },
              {
                "score": 1,
                "description": "The habit appears to have been maintained with ease and little effort, suggesting limited experience in overcoming obstacles."
              }
            ]
          }
        ]
      }
    },
    {
      "id": 3,
      "title": "Scenario",
      "questionText": "A small coastal town experiences a sudden increase in jellyfish sightings near its popular beaches. Local marine biologists report no significant changes in water temperature or acidity. The town recently upgraded its sewage treatment plant and banned certain sunscreens to protect coral reefs. Tourism has increased by 10% compared to last year, with more visitors from neighboring countries. A new fishing regulation limits catches of certain species. Curiously, sales of ice cream and bottled water have spiked, while sales of inflatable pool toys have decreased. The town's annual sandcastle competition was canceled due to lack of funding.",
      "instructions": "What do you think is the most likely reason for the increase in jellyfish sightings? Think out loud and explain your reasoning",
      "timeLimit": 300
    },
    {
      "id": 4,
      "title": "Scenario",
      "questionText": "A small island community of 500 people is facing a crisis. Their only school, which serves all age groups, has been severely damaged by a storm. With limited resources and no immediate help from the mainland, the islanders must find a way to continue education for their children. The island has abundant natural resources but lacks modern technology. The community values education highly but also needs to maintain essential services like fishing and farming. How can they ensure continuous learning for all students while dealing with their limited resources and isolation?",
      "instructions": "How would you solve this problem? Think out loud.",
      "timeLimit": 300
    },
    {
      "id": 5,
      "title": "Scenario",
      "questionText": "You're a software developer with 4 hours left in your workday. You have these tasks: 1 - Fix a critical bug in the production system - 2 Complete code review for a colleague's pull request - 3 Finish writing unit tests for a new feature 4. Attend a 30-minute team standup (starts in 1 hour)",
      "instructions": "Estimate the time for each task and create a prioritized schedule.",
      "timeLimit": 300
    },
    {
      "id": 6,
      "title": "Concept",
      "questionText": "Parkinson's Law is the idea that 'work expands to fill the time available for its completion.' This means that if you give yourself a week to complete a two-hour task, the task will take up the whole week because you'll stretch it out or procrastinate. On the other hand, if you give yourself a tighter deadline, you're more likely to complete the task efficiently. The idea encourages setting shorter deadlines to increase productivity and avoid wasting time.",
      "instructions": "We will explain you a concept and then ask you questions about it.",
      "timeLimit": 60
    },
    {
      "id": 6,
      "title": "Concept",
      "questionText": "",
      "instructions": "Can you summarize Parkinson's Law in your own words?",
      "timeLimit": 120
    }
  ]
}
